[
  {
    "audio_path": "1library.m4a",
    "speaker_turns": [
      {
        "speaker": "1",
        "text": "I need to return these books and pay a fee"
      },
      {
        "speaker": "2",
        "text": "Let me check your account. How long are they overdue?"
      },
      {
        "speaker": "1",
        "text": "I think just about a week past the due date."
      },
      {
        "speaker": "2",
        "text": "The fee will be $3.50 would you like to renew any of them?"
      },
      {
        "speaker": "1",
        "text": "Yes, could I renew the mystery novel for another two weeks?"
      }
    ]
  },
  {
    "audio_path": "2coffee.m4a",
    "speaker_turns": [
      {
        "speaker": "1",
        "text": "Hi there! I'd like to order a large cappuccino with oat milk, please."
      },
      {
        "speaker": "2",
        "text": "Of course! Would you like any flavoring syrups with that?"
      },
      {
        "speaker": "1",
        "text": "Yes, could I get vanilla syrup, but just one pump?"
      },
      {
        "speaker": "2",
        "text": "So think that would be 5.75 would you like your receipt? No I see, me that thank you, I'll pay with card."
      }
    ]
  },
  {
    "audio_path": "3meeting_schedule.m4a",
    "speaker_turns": [
      {
        "speaker": "1",
        "text": "I need to reschedule our team meeting for next week"
      },
      {
        "speaker": "2",
        "text": "No problem. What day works better for you?"
      },
      {
        "speaker": "1",
        "text": "Could we move it to Wednesday afternoon instead of Tuesday?"
      },
      {
        "speaker": "2",
        "text": "Wednesday works for me. How about 2 PM? "
      },
      {
        "speaker": "1",
        "text": "Perfect, I'll send out a calendar update"
      }
    ]
  },
  {
    "audio_path": "4restaurant.m4a",
    "speaker_turns": [
      {
        "speaker": "1",
        "text": "Good evening, I'd like to make a reservation for Friday night"
      },
      {
        "speaker": "2",
        "text": "I'd be happy to help. How many people will be dining?"
      },
      {
        "speaker": "1",
        "text": " There will be four of us, around 7:30 if possible."
      },
      {
        "speaker": "2",
        "text": "Let me check... Yes, we have a table available at 7:30."
      },
      {
        "speaker": "1",
        "text": "Wonderful, please put it under the name Johnson."
      }
    ]
  },
  {
    "audio_path": "5tech_support.m4a",
    "speaker_turns": [
      {
        "speaker": "1",
        "text": "I'm having trouble connecting to the office WiFi network."
      },
      {
        "speaker": "2",
        "text": " Have you tried restarting your computer first?"
      },
      {
        "speaker": "1",
        "text": " Yes, I did that but it's still not working. "
      },
      {
        "speaker": "2",
        "text": "Okay, can you see the network in your WiFi list?"
      },

      {
        "speaker": "1",
        "text": "No, it's not showing up at all anymore."
      }
    ]
  }
]
